# -*- coding: utf-8 -*-
# @Time  : 2022/3/19 18:04
# @Author : lovemefan
# @Email : lovemefan@outlook.com
# @File : unicode2utf8.py
# 玄声 锐声 问声 跌声 重声+-+-
list_vi = [('à', 'à'), ('á', 'á'), ('ả', 'ả'), ('ã', 'ã'), ('ạ', 'ạ'),  # 'a'
           ('À', 'À'), ('Á', 'Á'), ('Ả', 'Ả'), ('Ã', 'Ã'), ('Ạ', 'Ạ'),  # 'A'
           ('ằ', 'ằ'), ('ắ', 'ắ'), ('ẳ', 'ẳ'), ('ẵ', 'ẵ'), ('ặ', 'ặ'),  # 'ă'
           ('Ằ', 'Ằ'), ('Ắ', 'Ắ'), ('Ẳ', 'Ẳ'), ('Ẵ', 'Ẵ'), ('Ặ', 'Ặ'),  # 'Ă'
           ('ầ', 'ầ'), ('ấ', 'ấ'), ('ẩ', 'ẩ'), ('ẫ', 'ẫ'), ('ậ', 'ậ'),  # 'â'
           ('Ầ', 'Ầ'), ('Ấ', 'Ấ'), ('Ẩ', 'Ẩ'), ('Ẫ', 'Ẫ'), ('Ậ', 'Ậ'),  # 'Â'
           ('è', 'è'), ('é', 'é'), ('ẻ', 'ẻ'), ('ẽ', 'ẽ'), ('ẹ', 'ẹ'),  # 'e'
           ('È', 'È'), ('É', 'É'), ('Ẻ', 'Ẻ'), ('Ẽ', 'Ẽ'), ('Ẹ', 'Ẹ'),  # 'E'
           ('ề', 'ề'), ('ế', 'ế'), ('ể', 'ể'), ('ễ', 'ẽ'), ('ệ', 'ệ'),  # 'ê'
           ('Ề', 'Ề'), ('Ế', 'Ế'), ('Ể', 'Ể'), ('Ễ', 'Ễ'), ('Ệ', 'Ệ'),  # 'Ê'
           ('ì', 'ì'), ('í', 'í'), ('ỉ', 'ỉ'), ('ĩ', 'ĩ'), ('ị', 'ị'),  # 'i'
           ('Ì', 'Ì'), ('Í', 'Í'), ('Ỉ', 'Ỉ'), ('Ĩ', 'Ĩ'), ('Ị', 'Ị'),  # 'I'
           ('ò', 'ò'), ('ó', 'ó'), ('ỏ', 'ỏ'), ('õ', 'õ'), ('ọ', 'ọ'),  # 'o'
           ('Ò', 'Ò'), ('Ó', 'Ó'), ('Ỏ', 'Ỏ'), ('Õ', 'Õ'), ('Ọ', 'Ọ'),  # 'O'
           ('ồ', 'ồ'), ('ố', 'ố'), ('ổ', 'ổ'), ('ỗ', 'ỗ'), ('ộ', 'ộ'),  # 'ô'
           ('Ồ', 'Ồ'), ('Ố', 'Ố'), ('Ổ', 'Ổ'), ('Ỗ', 'Ỗ'), ('Ộ', 'Ộ'),  # 'Ô'
           ('ờ', 'ờ'), ('ớ', 'ớ'), ('ở', 'ở'), ('ỡ', 'ỡ'), ('ợ', 'ợ'),  # 'ơ'
           ('Ờ', 'Ờ'), ('Ớ', 'Ớ'), ('Ở', 'Ở'), ('Ỡ', 'Ỡ'), ('Ợ', 'Ợ'),  # 'Ơ'
           ('ù', 'ù'), ('ú', 'ú'), ('ủ', 'ủ'), ('ũ', 'ũ'), ('ụ', 'ụ'),  # 'u'
           ('Ù', 'Ù'), ('Ú', 'Ú'), ('Ủ', 'Ủ'), ('Ũ', 'Ũ'), ('Ụ', 'Ụ'),  # 'U'
           ('ừ', 'ừ'), ('ứ', 'ứ'), ('ử', 'ử'), ('ữ', 'ữ'), ('ự', 'ự'),  # 'ư'
           ('Ừ', 'Ừ'), ('Ứ', 'Ứ'), ('Ử', 'Ử'), ('Ữ', 'Ữ'), ('Ự', 'Ự'),  # 'Ư'
           ('ỳ', 'ỳ'), ('ý', 'ý'), ('ỷ', 'ỷ'), ('ỹ', 'ỹ'), ('ỵ', 'ỵ'),  # 'y'
           ('Ỳ', 'Ỳ'), ('Ý', 'Ý'), ('Ỷ', 'Ỷ'), ('Ỹ', 'Ỹ'), ('Ỵ', 'Ỵ'),  # 'Y'
           ]


def vi_to_utf8(text: str):
    """replace invalid characters of vietnamese"""
    for i in range(len(list_vi)):
        text = text.replace(list_vi[i][0], list_vi[i][1])
    return text
